Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 15)]              0         
_________________________________________________________________
dense (Dense)                (None, 15)                240       
_________________________________________________________________
dense_1 (Dense)              (None, 7)                 112       
_________________________________________________________________
dense_2 (Dense)              (None, 15)                120       
_________________________________________________________________
dense_3 (Dense)              (None, 15)                240       
=================================================================
Total params: 712
Trainable params: 712
Non-trainable params: 0
_________________________________________________________________
